<?php
// app/Mail/VerifyEmailCodeMail.php
namespace App\Mail;

use Illuminate\Mail\Mailable;
use App\Models\User;

class SendMessageMail extends Mailable
{
    public function __construct() {}

    public function build()
    {
        return $this->subject('Message')
            ->view('emails.message')
            ->with(['message' => "أتمنى أن تكون بخير. أشكرك على تقديم طلبك للترقية إلى [المسمى الوظيفي المطلوب] ومشاركتك رؤيتك حول كيفية مساهمتك في تطوير فريقنا.

بعد مراجعة طلبك بعناية، نأسف لإبلاغك بأننا لن نتمكن من منحك الترقية في الوقت الحالي. هذا القرار جاء بعد تقييم شامل للأداء الحالي ومتطلبات الدور الجديد. 

نحن نقدر جهودك الكبيرة والمستمرة في العمل، ونشجعك على الاستمرار في تطوير مهاراتك وتوسيع خبراتك. نود أن نعمل معك على وضع خطة لتحسين أدائك في المستقبل، مما قد يساعدك في تحقيق أهدافك المهنية.

إذا كانت لديك أي أسئلة أو كنت ترغب في مناقشة هذا القرار بشكل أكبر، فلا تتردد في التواصل معي.

شكرًا لتفهمك ونتمنى لك كل النجاح في مسيرتك المهنية"]);
    }
}
